backend: tensorflow
class_name: Sequential
config:
- class_name: Dense
  config:
    activation: sigmoid
    activity_regularizer: null
    batch_input_shape: !!python/tuple [null, 6]
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    dtype: float32
    kernel_constraint: null
    kernel_initializer:
      class_name: RandomNormal
      config: {mean: 0.0, seed: null, stddev: 0.05}
    kernel_regularizer: null
    name: dense_4
    trainable: false
    units: 6
    use_bias: true
- class_name: Dense
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    kernel_constraint: null
    kernel_initializer:
      class_name: RandomNormal
      config: {mean: 0.0, seed: null, stddev: 0.05}
    kernel_regularizer: null
    name: dense_5
    trainable: false
    units: 12
    use_bias: true
- class_name: Dense
  config:
    activation: sigmoid
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    kernel_constraint: null
    kernel_initializer:
      class_name: RandomNormal
      config: {mean: 0.0, seed: null, stddev: 0.05}
    kernel_regularizer: null
    name: dense_7
    trainable: true
    units: 1
    use_bias: true
keras_version: 2.1.4
